___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

# Aggregation & Groupby

The ``groupby`` method allows you to group rows of data together and call aggregate functions

### Basic aggregation methods:

* ``count()``
* ``mean()``
* ``median()``
* ``min()``
* ``max()``
* ``std()``
* ``var()``
* ``sum()``

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

 - # ``df.groupby()``

In [2]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [3]:
df['method'].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [4]:
df.groupby("method")[["distance"]].mean()

                                  distance
method
Astrometry                       17.875000
Eclipse Timing Variations       315.360000
Imaging                          67.715937
Microlensing                   4144.000000
Orbital Brightness Modulation  1180.000000
Pulsar Timing                  1200.000000
Pulsation Timing Variations            NaN
Radial Velocity                  51.600208
Transit                         599.298080
Transit Timing Variations      1104.333333

In [5]:
df.columns

Index(['method', 'number', 'orbital_period', 'mass', 'distance', 'year'], dtype='object')

In [6]:
df.groupby('method')[['distance']].sum()

                                distance
method
Astrometry                         35.75
Eclipse Timing Variations        1261.44
Imaging                          2166.91
Microlensing                    41440.00
Orbital Brightness Modulation    2360.00
Pulsar Timing                    1200.00
Pulsation Timing Variations         0.00
Radial Velocity                 27348.11
Transit                        134242.77
Transit Timing Variations        3313.00

In [7]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [8]:
df.groupby('year')['mass'].count()

year
1989     1
1992     0
1994     0
1995     1
1996     4
1997     1
1998     5
1999    14
2000    14
2001    11
2002    31
2003    22
2004    15
2005    34
2006    20
2007    32
2008    43
2009    74
2010    41
2011    91
2012    24
2013    30
2014     5
Name: mass, dtype: int64

In [9]:
df.corr()

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

 - # ``DataFrame`` Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show **Common Operations** here in this lecture:

- Quick review and refresh

In [10]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz'],
                    'col4':['AbC','dh','Dh','ASD']})
df2.head()

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

**Get column and index names:**

In [11]:
df2.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [12]:
df2.index

RangeIndex(start=0, stop=4, step=1)

**Sorting and Ordering a DataFrame:**

In [14]:
df2

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

In [15]:
df2.sort_values(by=['col1'])
# inplace=False by default

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

**Map / Replace**

In [ ]:
data = {'Company':['GOOGLE', 'GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FACE', 'FACE'],
       'Person':['PB', 'Chandler', 'Ross', 'Joey', 'Rachel', 'Monica'],
       'Sales':[100, 140, 150, 99, 102, 110]}

In [ ]:
df4=pd.DataFrame(data)

In [ ]:
df4

In [ ]:
my_map={'GOOGLE':'GOO','MICROSOFT':'MIC','FACE':'FB'}

In [ ]:
df_m=df4.copy()

In [ ]:
df_m.Company=df_m.Company.map(my_map)

In [ ]:
df_m

In [ ]:
df_m['Sales']=df_m.Sales.map(lambda x: x*1000)
df_m

In [ ]:
df_m['Company'].replace(to_replace='GOO',value='Google')

**Duplicate / Between**

In [16]:
dup_df = pd.DataFrame([5,5,6,7,8,8,7],['a','b','c','d','e','f','g'])
dup_df

   0
a  5
b  5
c  6
d  7
e  8
f  8
g  7

In [17]:
dup_df.drop_duplicates()

   0
a  5
c  6
d  7
e  8

In [18]:
dup_df[0].between(7,9, inclusive=True)

a    False
b    False
c    False
d     True
e     True
f     True
g     True
Name: 0, dtype: bool

- ### `.aggregate()`
- ### `.filter()`
- ### `.transform()`
- ### `.apply()`
- ### `.pivot_table()`

In [19]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df6

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

### ``.aggregate()``

In [ ]:
df6.groupby('groups').mean()

In [ ]:
df6.groupby('groups').aggregate([np.min,np.median,np.max])

In [ ]:
df6.groupby('groups').agg([min,'median',max])

In [ ]:
df6.groupby('groups').agg({'var1':('min','max') , 'var2':'median'})

### ``.filter()``

In [20]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df7

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [21]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [22]:
df7.groupby("groups").std()

             var1        var2
groups
A       28.284271  282.842712
B       22.627417  212.132034
C       49.497475  282.842712

In [31]:
def filter_func(x):
    return x["var1"].mean() < 36

In [32]:
df7.groupby("groups").mean()

        var1  var2
groups
A         30   300
B         36   350
C         65   500

In [33]:
# returns the rows that meet the condition, as a DataFrame
df7.groupby('groups').filter(filter_func)

  groups  var1  var2
0      A    10   100
3      A    50   500

In [34]:
df7.groupby("groups").sum()

        var1  var2
groups
A         60   600
B         72   700
C        130  1000

In [35]:
df7.groupby('groups').filter(lambda x : x['var2'].sum()<800)

  groups  var1  var2
0      A    10   100
1      B    20   200
3      A    50   500
4      B    52   500

### ``.transform()``

In [36]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df8

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [37]:
df8.groupby('groups').transform('mean')

   var1  var2
0    30   300
1    36   350
2    65   500
3    30   300
4    36   350
5    65   500

In [ ]:
df8.groupby('groups').transform(np.log)

In [ ]:
df8.var1.transform(np.exp)

### ``.apply()``

In [40]:
df9 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,20,30,50,52,100],
                   'var2': [100,200,300,500,500,700]})
df9

  groups  var1  var2
0      A    10   100
1      B    20   200
2      C    30   300
3      A    50   500
4      B    52   500
5      C   100   700

In [39]:
df9.apply(np.sum)

groups    ABCABC
var1         262
var2        2300
dtype: object

In [ ]:
df9.var1.sum()

In [ ]:
df_numeric = df9.iloc[:,1:3]

In [ ]:
df_numeric

In [ ]:
df_numeric.apply(np.mean, axis=1)

In [ ]:
df9.groupby('groups').apply(np.mean)

### `df.transform() vs df.apply()`

In [41]:
df10 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz'],
                    'col4':['AbC','dh','Dh','ASD']})
df10

   col1  col2 col3 col4
0     1   444  abc  AbC
1     2   555  def   dh
2     3   666  ghi   Dh
3     4   444  xyz  ASD

In [42]:
df10["col4"].transform(len)

0    3
1    2
2    2
3    3
Name: col4, dtype: int64

In [43]:
#returns the length of each variable (columns) separately
df10.apply(len)

col1    4
col2    4
col3    4
col4    4
dtype: int64

In [44]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])
df3 = pd.concat([df1, df2], ignore_index=True)
df3

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [45]:
# returns a DataFrame that does not have the same length as itself
df3.groupby("grp").apply(sum)

      grp   P    Q
grp
a    aaaa  36  100
b     bbb  27   75

In [46]:
df3.groupby("grp").transform(sum)

    P    Q
0  36  100
1  36  100
2  36  100
3  36  100
4  27   75
5  27   75
6  27   75

### Pivot Tables

In [47]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
titanic.groupby(["sex","class"])[["survived"]].mean()

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [49]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

### Using pivot table

- Create a spreadsheet-style pivot table as a ``DataFrame``.

In [50]:
titanic.pivot_table('survived',index='sex',columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [52]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [53]:
df5.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Missing Values & Outliers

- # Handling with Missing Values

**Missing value handling methods**

 1. <b>Deleting Rows</b> ----->if it has more than 70-75% of missing values
    
 2. <b>Replacing With Mean/Median/Mode (Imputation)</b>--->can be applied on a feature which has numeric data

 3. <b> Assigning An Unique Category</b>--->If a categorical feature has definite number of classes, we can assign another class
    
 4. <b>Predicting The Missing Values</b>---> we can predict the nulls with the help of a machine learning algorithm like linear regression

 5. <b>Using Algorithms Which Support Missing Values</b>--->KNN is a machine learning algorithm which works on the principle of distance measure.  This algorithm can be used when there are nulls present in the dataset.  KNN considers the missing values by taking the majority of the K nearest values

In [54]:
df = pd.DataFrame({'A':[4, 6, np.nan],
                  'B':[8, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [55]:
df

     A    B  C
0  4.0  8.0  1
1  6.0  NaN  2
2  NaN  NaN  3

NaN, standing for not a number, is a numeric data type used to represent any value that is undefined or unpresentable.

For example, 0/0 is undefined as a real number and is, therefore, represented by NaN. The square root of a negative number is an imaginary number that cannot be represented as a real number, so, it is represented by NaN.

NaN is also assigned to variables, in a computation, that do not have values and have yet to be computed.

In [56]:
df.dropna(thresh=2,axis=1)

     A  C
0  4.0  1
1  6.0  2
2  NaN  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

In [ ]:
import numpy as np
import pandas as pd
V1 = np.array([2,4,6,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,11,8,5,10,6,np.NaN,4,20])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}        
)

df

In [ ]:
#number of missing values in the columns
df.isnull().sum()

In [ ]:
# what percent of the variables have missing values
df.isnull().sum()/len(df)

In [ ]:
df.notnull().sum()

In [ ]:
df.Var1[df.Var1.isnull()]

In [ ]:
# columns/variables containing any missing values
df.isnull().any()

In [ ]:
df

In [ ]:
df.isnull().any(axis = 1)

In [ ]:
# rows containing any missing values
df[df.isnull().any(axis = 1)]

In [ ]:
# rows containing full of notnull values
df[df.notnull().all(axis = 1)]

### Missing Values Handling Methods

 - #### Dropping

In [ ]:
df

In [ ]:
# index 6 is removed since its all values are missing.
df.dropna(how = "all")

In [ ]:
# it removes the columns which contains any (at least one missing value)
# missing value
df.dropna(axis = 1)

In [ ]:
# there is no dropping column since no column has full of missing value
df.dropna(axis = 1, how = "all")

 - #### Filling

In [ ]:
import numpy as np
import pandas as pd
V1 = np.array([2,3,5,np.NaN,7,1,np.NaN,10,14])
V2 = np.array([8,np.NaN,5,8,11,np.NaN,np.NaN,2,3])
V3 = np.array([np.NaN,13,5,6,13,7,np.NaN,3,30])
df = pd.DataFrame(
        {"Var1" : V1,
         "Var2" : V2,
         "Var3" : V3}        
)

df

In [ ]:
df

 - Filling with a specific value

In [ ]:
df["Var1"].fillna(0)

 - Filling with any Proper Value

In [ ]:
df["Var1"].mean()

In [ ]:
df["Var1"].fillna(df["Var1"].mean())

In [ ]:
# filling all columns/variables using Method - 1

df.apply(lambda x: x.fillna(x.mean()), axis = 0)

In [ ]:
# filling all columns/variables using Method - 2
df.mean()

In [ ]:
df

In [ ]:
df.fillna(df.mean())

In [ ]:
# we can fill Var1 with avg of Var1 and fill Var2 with avg of Var2
df.mean()["Var1":"Var2"]

In [ ]:
df.fillna(df.mean()["Var1":"Var2"])

In [ ]:
df["Var3"].fillna(df["Var3"].median())

In [ ]:
df

In [ ]:
pd.notna(df)

In [ ]:
df.where(pd.notna(df), df.mean(), axis = 1)

 - Filling with any Proper Value Regarding to Group of the Categorical Variables

In [ ]:
Var1 = np.array([2,3,5,np.NaN,7,8,9,np.NaN,15])
Var2 = np.array([6,np.NaN,7,10,12,np.NaN,np.NaN,22,33])
Var3 = np.array([np.NaN,10,13,12,14,19,np.NaN,25,35])
Var4 = np.array(["DS","DS","DS","FS","AWS","FS","FS","AWS","AWS"])

df = pd.DataFrame(
        {"salary" : Var1,
         "Var2" : Var2,
         "Var3" : Var3,
         "department" : Var4}        
)

df

In [ ]:
#regarding to avg of "salary" in terms of "department"

df.groupby("department")["salary"].mean()

In [ ]:
# we transformed the values of "salary" column into group average.

df.groupby("department")["salary"].transform("mean")  # take a look at the .transform()

In [ ]:
df

In [ ]:
df["salary"].fillna(df.groupby("department")["salary"].transform("mean"))

 - Filling the Missing Values of Categorical Values

In [ ]:
import numpy as np
import pandas as pd
V1 = np.array([5,9,16,np.NaN,17,21,np.NaN,29,35])
V4 = np.array(["FS",np.nan,"DS","DS","DS","FS",np.nan,"AWS","AWS"], dtype=object)

df = pd.DataFrame(
        {"salary" : V1,
        "department" : V4}        
)

df

In [ ]:
df["department"].fillna(df["department"].mode()[0])

In [ ]:
df

In [ ]:
df["department"].fillna(method = "bfill")

In [ ]:
df["department"].fillna(method = "ffill")

In [ ]:
df

In [ ]:
df.interpolate()
#look at numerical columns NaNs

 - # Handling with Outliers

<b>Outliers</b> are unusual values in your dataset, and they can distort statistical analyses and violate their assumptions. ... Outliers increase the variability in your data, which decreases statistical power. Consequently, excluding outliers can cause your results to become statistically significant. Outliers can have a disproportionate effect on statistical results, such as the mean, which can result in misleading interpretations. In this case, the mean value makes it seem that the data values are higher than they really are

## Catching and Detecting Outliers

In [ ]:
import seaborn as sns
df = sns.load_dataset('diamonds')
df = df.select_dtypes(include = ['float64', 'int64']) 
df = df.dropna()
df.head()

In [ ]:
# you don't need to know how this plotting happens.
# just focus on quarters
# remember Statistics lesson IQR

sns.boxplot(x = df.table)

In [ ]:
df_table = df["table"]

## Tukey's Fences | Tukey's Rule

- First way of specifying ``Q1 & Q3`` is using the ``.quantile()`` method

In [ ]:
Q1 = df_table.quantile(0.25)
Q3 = df_table.quantile(0.75)
IQR = Q3-Q1

In [ ]:
Q1

In [ ]:
Q3

In [ ]:
IQR

- Second way of specifying ``Q1 & Q3`` is using the ``.describe()`` method

In [ ]:
lower_lim = Q1 - 1.5 * IQR
upper_lim = Q3 + 1.5 * IQR

In [ ]:
lower_lim

In [ ]:
upper_lim

In [ ]:
outliers_15_low = (df_table < lower_lim)

In [ ]:
outliers_15_up = (df_table > upper_lim)

In [ ]:
len(df_table[outliers_15_low])

In [ ]:
len(df_table[outliers_15_up])

In [ ]:
len(df_table) - (len(df_table[outliers_15_low]) + len(df_table[outliers_15_up]))

In [ ]:
# the outliers according to the 1.5 

df_table[(outliers_15_low | outliers_15_up)]

In [ ]:
lower_lim = Q1 - 2.5 * IQR
upper_lim = Q3 + 2.5 * IQR

In [ ]:
lower_lim

In [ ]:
upper_lim

In [ ]:
outliers_25 = (df_table < lower_lim) | (df_table > upper_lim)

In [ ]:
# the outliers according to the 2.5 

df_table[outliers_25]

### Removing the Outliers

In [ ]:
# "table" column without outliers

df_table[~(outliers_15_low | outliers_15_up)]

In [ ]:
lower_lim = Q1 - 1.5 * IQR
upper_lim = Q3 + 1.5 * IQR

not_outliers_15 = (df_table >= lower_lim) & (df_table <= upper_lim)

In [ ]:
df_table[not_outliers_15]

In [ ]:
cleaned_df = df[not_outliers_15]

In [ ]:
cleaned_df

### Limitation and Transformation of the Outliers

- ### Limitation using ``.winsorize()`` method

In [ ]:
from scipy.stats.mstats import winsorize

In [ ]:
df

In [ ]:
df_table

In [ ]:
sns.boxplot(x = df_table)

In [ ]:
sns.displot(df_table, bins = 30, kde = False)

In [ ]:
df_table_win = winsorize(df_table, (0.01, 0.02))

In [ ]:
df_table_win

In [ ]:
sns.boxplot(x = df_table_win);

In [ ]:
sns.displot(df_table_win, bins = 11, kde =False)

In [ ]:
pd.DataFrame(df_table_win)

In [ ]:
pd.DataFrame(df_table_win)[0]

In [ ]:
df_table_win = pd.DataFrame(df_table_win)[0]

- **trimmed_by** =  ``n`` x (1 - ``sum(limit)``)

- ``Q1`` - **trimmed by** = new ``min`` value
- ``Q3`` + **trimmed by** = new ``max`` value

In [ ]:
df_table_win.describe()

In [ ]:
df_table.describe()

In [ ]:
df_table.sort_values().head(20)

In [ ]:
df_table_win.sort_values().head(20)

In [ ]:
df_table_win[11368]

In [ ]:
df_table_win[5144]

In [ ]:
df_table_win[df_table_win == 53]

In [ ]:
df_table[df_table == 53]

In [ ]:
df_table_win[df_table_win == 63]

In [ ]:
df_table[df_table == 63]

In [ ]:
Q1 = 56.0
Q3 = 59.0

In [ ]:
IQR = Q3 - Q1

In [ ]:
lower_lim = Q1 - 1.5 * IQR
upper_lim = Q3 + 1.5 * IQR

In [ ]:
lower_lim

In [ ]:
upper_lim

In [ ]:
(df_table_win < lower_lim) | (df_table_win > upper_lim)

In [ ]:
outliers_15 = (df_table_win < lower_lim) | (df_table_win > upper_lim)

In [ ]:
# the outliers according to the 1.5 
# there is no outliers
df_table[outliers_15]

- ### ``log()`` Transformation

In [ ]:
#if distribution is skewed use this

In [ ]:
df.info()

In [ ]:
df_carat = df["carat"]

In [ ]:
df_carat.shape

In [ ]:
df_carat.head()

In [ ]:
sns.boxplot(x = df_carat);

In [ ]:
sns.displot(df_carat, bins = 15, kde = False);

In [ ]:
df_carat_log = np.log(df_carat)

In [ ]:
df_carat_log

In [ ]:
sns.boxplot(x = df_carat_log);

In [ ]:
sns.displot(df_carat_log,  bins = 11, kde = False);

In [ ]:
Q1 = df_carat.quantile(0.25)
Q3 = df_carat.quantile(0.75)
IQR = Q3-Q1

In [ ]:
Q1

In [ ]:
Q3

In [ ]:
IQR

In [ ]:
lower_lim = Q1 - 1.5 * IQR
upper_lim = Q3 + 1.5 * IQR

In [ ]:
lower_lim

In [ ]:
upper_lim

In [ ]:
outliers_15 = (df_carat < lower_lim) | (df_carat > upper_lim)

In [ ]:
df_carat[outliers_15]

In [ ]:
df_carat_log

In [ ]:
Q1_log = df_carat_log.quantile(0.25)
Q3_log = df_carat_log.quantile(0.75)
IQR_log = Q3_log-Q1_log

In [ ]:
lower_lim_log = Q1_log - 1.5 * IQR_log
upper_lim_log = Q3_log + 1.5 * IQR_log

In [ ]:
lower_lim_log

In [ ]:
upper_lim_log

In [ ]:
outliers_15_log = (df_carat_log < lower_lim_log) | (df_carat_log > upper_lim_log)

In [ ]:
df_carat[outliers_15_log]

In [ ]:
df["carat_log"] = np.log(df["carat"])

In [ ]:
df

In [ ]:
df.drop("carat", axis=1)

In [ ]:
df.drop("carat", axis=1)[outliers_15_log]

In [ ]:
df.drop("carat", axis=1)[~outliers_15_log]

In [ ]:
cleaned_df = df.drop("carat", axis=1)[~outliers_15_log]

cleaned_df